benchmark/FieldExamples/Channel_Opt_Example/channelOPTBenchmarkOF/0/Ua
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            adjointInletVelocity;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            adjointOutletVelocity;
        value           uniform (0 0 0);
    }
    top_left
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    top_center
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    top_right
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    down
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    front
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    back
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
