benchmark/FieldExamples/Channel_Opt_Example/channelOPTBenchmarkOF/constant/Properties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// FoamX Case Dictionary.

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          bridgeProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
PatchName top_center;

Maximum_deformation_on_top 0.27;

Number_of_displacement_steps 1;

Center_of_deformation (2.5 1 1.25);

Radius_of_deformation 1;

Number_of_start_up 10;

Number_of_layers 7;

// ************************************************************************* //
