benchmark/FieldExamples/Channel_Opt_Example/channelOPTBenchmarkOF/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (1 0 0)
    (4 0 0)
    (5 0 0)

    (0 0.5 0)
    (1 0.5 0)
    (4 0.5 0)
    (5 0.5 0)

    (0 1 0)
    (1 1 0)
    (4 1 0)
    (5 1 0)

    (0 0 2.5)
    (1 0 2.5)
    (4 0 2.5)
    (5 0 2.5)

    (0 0.5 2.5)
    (1 0.5 2.5)
    (4 0.5 2.5)
    (5 0.5 2.5)

    (0 1 2.5)
    (1 1 2.5)
    (4 1 2.5)
    (5 1 2.5)
);

blocks
(
    hex (0 1 5 4 12 13 17 16) (10 15 25) simpleGrading (1 1 1)
    hex (1 2 6 5 13 14 18 17) (30 15 25) simpleGrading (1 1 1)
    hex (2 3 7 6 14 15 19 18) (10 15 25) simpleGrading (1 1 1)
    
    hex (4 5 9 8 16 17 21 20) (10 15 25) simpleGrading (1 1 1)
    hex (5 6 10 9 17 18 22 21) (30 15 25) simpleGrading (1 1 1)
    hex (6 7 11 10 18 19 23 22) (10 15 25) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (12 16 4 0)
	    (16 20 8 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (15 3 7 19)
            (19 7 11 23)
        );
    }
    top_left
    {
        type wall;
        faces
        (
            (20 21 9 8)
        );
    }
    top_center
    {
        type wall;
        faces
        (
            (21 22 10 9)
        );
    }
    top_right
    {
        type wall;
        faces
        (
            (22 23 11 10)
        );
    }
    down
    {
        type wall;
        faces
        (
            (13 12 0 1)
	    (14 13 1 2)
	    (15 14 2 3)
        );
    }
    front
    {
        type wall;
        faces
        (
            (12 13 17 16)
            (13 14 18 17)
	    (14 15 19 18)
	    (16 17 21 20)
	    (17 18 22 21)
	    (18 19 23 22)
        );
    }
    back
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
	    (2 6 7 3)
	    (4 8 9 5)
	    (5 9 10 6)
	    (6 10 11 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
