benchmark/FieldExamples/Channel_Opt_Example/channelOPTBenchmarkOF/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(pa)        Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linear;
    div(U)      Gauss linear;
//     div((nuEff*dev(grad(U).T()))) Gauss linear;
    div((nuEff*dev(T(grad(U))))) Gauss linear;
    div(-phi,Ua)    Gauss upwind;
//     div((nuEff*dev(grad(Ua).T()))) Gauss linear;
    div((nuEff*dev(T(grad(Ua))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
    laplacian(nu,U) Gauss linear corrected;
    laplacian((1|A(U)),p) Gauss linear corrected;
    laplacian(rUA,p) Gauss linear corrected;
    laplacian(diffusivity,cellMotionU) Gauss linear corrected;
    laplacian(diffusivity,cellDisplacement) Gauss linear uncorrected;
    laplacian(nuEff,U) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
    interpolate(HbyA) linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p ;
    pa;
}


// ************************************************************************* //
