benchmark/FieldExamples/Channel_Opt_Example/channelOPTBenchmarkOF/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

SIMPLE          
{
    nNonOrthogonalCorrectors 2;
    solvePrimal     yes;
    solveAdjoint    yes;
    updatePorosity  no;
    adjointPorousZones ();
    fixedPorousZones ();
    pressureReportCellZonePairs ();
    pressureReportPatches ();
    pressureReportFaceZones ();
    residualControl
    {
        p               1e-12;
        U               1e-13;
	pa               1e-10;
        Ua               1e-10;
        "(k|epsilon|omega)" 1e-4;
    }
}
solvers
{
    p               GAMG { agglomerator faceAreaPair ; mergeLevels 1 ; cacheAgglomeration true ; nCellsInCoarsestLevel 20 ; tolerance 1e-12 ; relTol 0 ; smoother GaussSeidel ; nPreSweeps 0 ; nPostSweeps 2 ; nFinestSweeps 2 ; };
    pa              GAMG { agglomerator faceAreaPair ; mergeLevels 1 ; cacheAgglomeration true ; nCellsInCoarsestLevel 20 ; tolerance 1e-12 ; relTol 0 ; smoother GaussSeidel ; nPreSweeps 0 ; nPostSweeps 2 ; nFinestSweeps 2 ; };
    U               BICCG 1e-12 0;
    Ua              BICCG 1e-12 0;
    k               BICCG 1e-12 0;
    epsilon         BICCG 1e-12 0;
    omega         BICCG 1e-12 0;
    R               BICCG 1e-12 0;
    nuTilda         BICCG 1e-12 0;
    nuaTilda         BICCG 1e-12 0;
    cellMotionU     GAMG { agglomerator faceAreaPair ; mergeLevels 1 ; cacheAgglomeration true ; nCellsInCoarsestLevel 20 ; tolerance 1e-12 ; relTol 0 ; smoother GaussSeidel ; nPreSweeps 0 ; nPostSweeps 2 ; nFinestSweeps 2 ; };
    cellDisplacement
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0;
    }
}


relaxationFactors 
{
    p               0.3;
    U               0.5;
    pa              0.7;
    Ua              0.3;
    k               0.2;
    epsilon         0.2;
    omega           0.2;
    nuTilda         0.2;
    nuaTilda         0.2;
}
// ************************************************************************* //
